---
kind: property
id: P:Autodesk.Revit.DB.ParameterMap.Size
source: html/5352efd0-bebd-baf1-8e2e-c5b12e464cff.htm
---
# Autodesk.Revit.DB.ParameterMap.Size Property

Returns the number of objects that are in the map.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```